#### Terraform Format and Style 🖌`success`
#### Terraform Initialization ⚙️`success`
#### Terraform Plan 📖`success`
#### Terraform Validation 🤖`success`

<details><summary>Show Plan</summary>

```

terraform
Running plan in the remote backend. Output will stream here. Pressing Ctrl-C
will stop streaming the logs, but will not stop the plan running remotely.

Preparing the remote plan...

To view this run in a browser, visit:
https://app.terraform.io/app/james-personal-account/aws-nuclei/runs/run-SvSmFBzjbvZ8pqnt

Waiting for the plan to start...

Terraform v1.2.2
on linux_amd64
Initializing plugins and modules...
aws_lambda_layer_version.boto3_layer: Refreshing state... [id=arn:aws:lambda:us-west-2:847035122536:layer:boto3_layer:3]
aws_eip.natgw_eip: Refreshing state... [id=eipalloc-0a4e9e11e5c926383]
aws_default_subnet.default_az1: Refreshing state... [id=subnet-0e9b3892f4f02491c]
aws_sqs_queue.crawled_urls: Refreshing state... [id=https://sqs.us-west-2.amazonaws.com/847035122536/crawled_urls]
aws_iam_role.crawler_role: Refreshing state... [id=crawler_role]
aws_efs_file_system.nuclei_efs: Refreshing state... [id=fs-0c52002cea26f5b0a]
aws_iam_role.lambda_exec: Refreshing state... [id=serverless_lambda]
aws_default_vpc.default: Refreshing state... [id=vpc-00316a594b8442850]
aws_apigatewayv2_api.lambda: Refreshing state... [id=32j4ixnfl1]
aws_iam_role.scanner_role: Refreshing state... [id=scanner_role]
aws_nat_gateway.nat_gateway: Refreshing state... [id=nat-0ba686db12ac78bd2]
aws_cloudwatch_log_group.api_gw: Refreshing state... [id=/aws/api_gw/serverless_lambda_gw]
aws_iam_policy.sqs_publish_policy: Refreshing state... [id=arn:aws:iam::847035122536:policy/sqs_publish_policy]
aws_efs_access_point.nuclei_efs_access_point: Refreshing state... [id=fsap-0fbb0b5047c7df8c6]
aws_iam_role_policy_attachment.lambda_policy: Refreshing state... [id=serverless_lambda-20220616035130752900000002]
aws_lambda_function.test_lambda: Refreshing state... [id=hello_world]
aws_iam_role_policy_attachment.crawler_policy_attach_readonly: Refreshing state... [id=crawler_role-20220616035130771200000003]
aws_iam_role_policy_attachment.crawler_policy_attach_lambda_basic: Refreshing state... [id=crawler_role-20220616035130791500000004]
aws_lambda_function.crawler: Refreshing state... [id=crawler]
aws_iam_role_policy_attachment.scanner_policy_attach_sqs_execution: Refreshing state... [id=scanner_role-20220616035130907600000008]
aws_iam_role_policy_attachment.scanner_policy_attach_lambda_basic: Refreshing state... [id=scanner_role-20220616035130850800000005]
aws_iam_role_policy_attachment.scanner_policy_attach_vpc_access: Refreshing state... [id=scanner_role-20220616035130861100000007]
aws_iam_role_policy_attachment.scanner_policy_attach_efs_access: Refreshing state... [id=scanner_role-20220616035130854700000006]
aws_iam_role_policy_attachment.crawler_policy_attach_sqs_publish: Refreshing state... [id=crawler_role-20220616035156247900000009]
aws_lambda_permission.api_gw: Refreshing state... [id=AllowExecutionFromAPIGateway]
aws_lambda_function_url.test_live: Refreshing state... [id=hello_world]
aws_apigatewayv2_integration.test_lambda: Refreshing state... [id=sbejgdq]
aws_cloudwatch_log_group.test_lambda: Refreshing state... [id=/aws/lambda/hello_world]
aws_cloudwatch_log_group.crawler: Refreshing state... [id=/aws/lambda/crawler]
aws_apigatewayv2_stage.lambda: Refreshing state... [id=serverless_lambda_stage]
aws_apigatewayv2_route.test_lambda: Refreshing state... [id=dg3h235]
aws_subnet.private_az1: Refreshing state... [id=subnet-031c8bc2b6d54ae65]
aws_default_security_group.default: Refreshing state... [id=sg-0dfa3e4d75f7cdb3a]
aws_subnet.private_az2: Refreshing state... [id=subnet-0fa04ec2fa0223908]
aws_route_table.private_rt: Refreshing state... [id=rtb-00f038fc0e4e7d764]
aws_efs_mount_target.nuclei_efs_mount_target1: Refreshing state... [id=fsmt-07d6b651f97e6c5eb]
aws_efs_mount_target.nuclei_efs_mount_target2: Refreshing state... [id=fsmt-0147c3d92467f1464]
aws_route_table_association.subnet1_rt: Refreshing state... [id=rtbassoc-0f760019a54d6e578]
aws_route_table_association.subnet2_rt: Refreshing state... [id=rtbassoc-00d044df1f26c0843]
aws_lambda_function.scanner: Refreshing state... [id=scanner]
aws_cloudwatch_log_group.scanner: Refreshing state... [id=/aws/lambda/scanner]
aws_lambda_event_source_mapping.example: Refreshing state... [id=5251f975-a9e1-4796-991f-0cb61d4f3cf8]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create
  ~ update in-place

Terraform will perform the following actions:

  # aws_db_subnet_group.private will be created
  + resource "aws_db_subnet_group" "private" {
      + arn         = (known after apply)
      + description = "Managed by Terraform"
      + id          = (known after apply)
      + name        = "private"
      + name_prefix = (known after apply)
      + subnet_ids  = [
          + "subnet-031c8bc2b6d54ae65",
          + "subnet-0fa04ec2fa0223908",
        ]
      + tags        = {
          + "Name" = "My private DB subnet group"
        }
      + tags_all    = {
          + "Name" = "My private DB subnet group"
        }
    }

  # aws_iam_policy.rds_connect_policy will be created
  + resource "aws_iam_policy" "rds_connect_policy" {
      + arn         = (known after apply)
      + description = "Grants permission to publish to the vuln_db RDS cluster"
      + id          = (known after apply)
      + name        = "rds_connect_policy"
      + path        = "/"
      + policy      = (known after apply)
      + policy_id   = (known after apply)
      + tags_all    = (known after apply)
    }

  # aws_iam_role_policy_attachment.scanner_policy_attach_rds_access will be created
  + resource "aws_iam_role_policy_attachment" "scanner_policy_attach_rds_access" {
      + id         = (known after apply)
      + policy_arn = (known after apply)
      + role       = "scanner_role"
    }

  # aws_lambda_function.crawler will be updated in-place
  ~ resource "aws_lambda_function" "crawler" {
        id                             = "crawler"
      ~ last_modified                  = "2022-06-17T04:09:46.000+0000" -> (known after apply)
      ~ source_code_hash               = "kEhNGktj2I6sVKCfuhOnoQ5lkEQw/gBeQyh0p2MCg94=" -> "VIVXD25glPHOEQZUu348eAcIkbNTLLf7vQambAn3ZnE="
        tags                           = {}
        # (18 unchanged attributes hidden)



        # (3 unchanged blocks hidden)
    }

  # aws_lambda_function.scanner will be updated in-place
  ~ resource "aws_lambda_function" "scanner" {
        id                             = "scanner"
      ~ last_modified                  = "2022-06-17T04:17:18.000+0000" -> (known after apply)
      ~ source_code_hash               = "yyPFIFqo/N7ImHapDsaZQ2+DAVIf26II/OPTDd8hL6k=" -> "TWGRqHyLClji7p6Xa3yxbsth0kpJ7saj3JG3ac/Ra30="
        tags                           = {}
        # (18 unchanged attributes hidden)





        # (5 unchanged blocks hidden)
    }

  # aws_lambda_function.test_lambda will be updated in-place
  ~ resource "aws_lambda_function" "test_lambda" {
        id                             = "hello_world"
      ~ last_modified                  = "2022-06-17T04:24:16.899+0000" -> (known after apply)
      ~ source_code_hash               = "0/1EFrFwmcZcPaI3PfQ/u2WVyNXWBlDwcvPK6Cafp4c=" -> "GZp1xeOTJAZ6mzUZEhpodhNL8KBBFFa4gONaZDDNjTI="
        tags                           = {}
        # (18 unchanged attributes hidden)


        # (2 unchanged blocks hidden)
    }

  # aws_rds_cluster.vuln_db_cluster will be created
  + resource "aws_rds_cluster" "vuln_db_cluster" {
      + allocated_storage                   = (known after apply)
      + apply_immediately                   = (known after apply)
      + arn                                 = (known after apply)
      + availability_zones                  = (known after apply)
      + backup_retention_period             = 1
      + cluster_identifier                  = "vuln-db-cluster"
      + cluster_identifier_prefix           = (known after apply)
      + cluster_members                     = (known after apply)
      + cluster_resource_id                 = (known after apply)
      + copy_tags_to_snapshot               = false
      + database_name                       = "vuln_db"
      + db_cluster_parameter_group_name     = (known after apply)
      + db_subnet_group_name                = (known after apply)
      + enable_global_write_forwarding      = false
      + enable_http_endpoint                = false
      + endpoint                            = (known after apply)
      + engine                              = "aurora-postgresql"
      + engine_mode                         = "provisioned"
      + engine_version                      = "13.6"
      + engine_version_actual               = (known after apply)
      + hosted_zone_id                      = (known after apply)
      + iam_database_authentication_enabled = true
      + iam_roles                           = (known after apply)
      + id                                  = (known after apply)
      + kms_key_id                          = (known after apply)
      + master_password                     = (sensitive value)
      + master_username                     = "test"
      + port                                = (known after apply)
      + preferred_backup_window             = (known after apply)
      + preferred_maintenance_window        = (known after apply)
      + reader_endpoint                     = (known after apply)
      + skip_final_snapshot                 = false
      + storage_encrypted                   = (known after apply)
      + tags_all                            = (known after apply)
      + vpc_security_group_ids              = (known after apply)

      + serverlessv2_scaling_configuration {
          + max_capacity = 1
          + min_capacity = 0.5
        }
    }

  # aws_rds_cluster_instance.vuln_db_instance will be created
  + resource "aws_rds_cluster_instance" "vuln_db_instance" {
      + apply_immediately                     = (known after apply)
      + arn                                   = (known after apply)
      + auto_minor_version_upgrade            = true
      + availability_zone                     = (known after apply)
      + ca_cert_identifier                    = (known after apply)
      + cluster_identifier                    = (known after apply)
      + copy_tags_to_snapshot                 = false
      + db_parameter_group_name               = (known after apply)
      + db_subnet_group_name                  = (known after apply)
      + dbi_resource_id                       = (known after apply)
      + endpoint                              = (known after apply)
      + engine                                = "aurora-postgresql"
      + engine_version                        = "13.6"
      + engine_version_actual                 = (known after apply)
      + id                                    = (known after apply)
      + identifier                            = (known after apply)
      + identifier_prefix                     = (known after apply)
      + instance_class                        = "db.serverless"
      + kms_key_id                            = (known after apply)
      + monitoring_interval                   = 0
      + monitoring_role_arn                   = (known after apply)
      + performance_insights_enabled          = (known after apply)
      + performance_insights_kms_key_id       = (known after apply)
      + performance_insights_retention_period = (known after apply)
      + port                                  = (known after apply)
      + preferred_backup_window               = (known after apply)
      + preferred_maintenance_window          = (known after apply)
      + promotion_tier                        = 0
      + publicly_accessible                   = false
      + storage_encrypted                     = (known after apply)
      + tags_all                              = (known after apply)
      + writer                                = (known after apply)
    }

Plan: 5 to add, 3 to change, 0 to destroy.

Changes to Outputs:
  + rds_arn = (known after apply)

```

</details>

*Pushed by: @Jamolo5, Action: `pull_request`*